<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">

  <title><![CDATA[Category: continous deployment | Hron's blog]]></title>
  <link href="http://hron.me/blog/tags/continous-deployment/atom.xml" rel="self"/>
  <link href="http://hron.me/"/>
  <updated>2012-10-22T22:27:33+02:00</updated>
  <id>http://hron.me/</id>
  <author>
    <name><![CDATA[Gábor Garami]]></name>
    
  </author>
  <generator uri="http://octopress.org/">Octopress</generator>

  
  <entry>
    <title type="html"><![CDATA[Continous deployment, vagy afféle]]></title>
    <link href="http://hron.me/blog/2012/06/continous-deployment-vagy-affele/"/>
    <updated>2012-06-07T00:56:00+02:00</updated>
    <id>http://hron.me/blog/2012/06/continous-deployment-vagy-affele</id>
    <content type="html"><![CDATA[<p>Az ember a netet olvasgatva &eacute;rdekes dolgokra tud bukkanni, illetve sokszor nagyon j&oacute; &ouml;tleteket lehet kapni puszt&aacute;n a m&aacute;sok &iacute;r&aacute;saib&oacute;l.</p>

<p><a href="http://infokukac.com/2011/11/csak-egy-gombnyomas%E2%80%A6/">Info@ &iacute;rt</a> arr&oacute;l, hogy n&aacute;luk hogy ker&uuml;lt bevezet&eacute;sre az, hogy a tesztel&ouml;k gombnyom&aacute;sra deployolnak a teszt rendszerre verzi&oacute;kat. B&aacute;r n&aacute;lam max 1 tesztel&ouml; lenne, &eacute;s &ouml;t sem szeretn&eacute;m a Jenkins k&ouml;zel&eacute;be engedni, az&eacute;rt elgondolkodtatott a dolog: mi volna, ha a Jenkins egyr&eacute;szt monitorozn&aacute; a deploy &aacute;gat (ez n&aacute;lam a master &aacute;g, <a href="http://hron.me/blog/2012/04/a-legjobb-git-workflow-tovabbfejlesztve/">amint azt m&aacute;r eml&iacute;tettem</a>), ezen v&eacute;grehajtana egy deployment tesztet is a staging k&ouml;rnyezetre (ezzel lenne egy folyamatosan friss teszt k&ouml;rnyezet), illetve adott esetben meg lehetne k&eacute;rni &ouml;t arra, hogy, legyen m&aacute;r kedves az &eacute;les szerverre is kidobni az aktu&aacute;l k&oacute;dot.</p>

<p>Ez amennyire bonyolultan hangzik, annyira egyszer&uuml; volt megoldani. Egyr&eacute;szt a staging &eacute;s az &eacute;les szerverre fel kellett venni a Jenkins saj&aacute;t SSH kulcs&aacute;t (m&aacute;r r&eacute;gebbr&ouml;l volt ilyenem, mert a Jenkins slave-k kezel&eacute;s&eacute;hez kell), m&aacute;sr&eacute;szt kellett k&eacute;t olyan jobot csin&aacute;lni, amelyek elv&eacute;gzik a fent eml&iacute;tett k&eacute;t m&uuml;veletet.</p>

<p>Ut&aacute;na fogtam, lem&aacute;soltam azt a jobot, ami a norm&aacute;l (nem deployol&oacute;s) teszteket csin&aacute;lja, hozz&aacute;csaptam m&eacute;g egy l&eacute;p&eacute;st, miszerint deployoljon is a staging k&ouml;rnyezetbe. Illetve &aacute;t&iacute;rtam, hogy a master &aacute;gat figyelje.
Annyit m&eacute;g egyszer&uuml;s&iacute;tettem a dolgon, hogy egyik tesztn&eacute;l sem csin&aacute;lok coverage m&eacute;r&eacute;st, mert ez csak lass&iacute;tja a tesztek futtat&aacute;s&aacute;t, de &eacute;rdemi eredm&eacute;nyt nem ad hozz&aacute; a teszthez, hiszen itt a tesztek lefut&aacute;sa is csak az&eacute;rt fontos, hogy ha valaki v&eacute;letlen&uuml;l r&aacute;comittolt volna az &eacute;les &aacute;gra, miel&ouml;tt lefutna a deployment teszt, az m&eacute;g kibukjon. De &aacute;ltal&aacute;ban senki nem szokott.</p>

<p>Az &eacute;les deploy job annyiban volt k&uuml;l&ouml;nb&ouml;z&ouml; ett&ouml;l, hogy itt m&eacute;g kikapcsoltam a pollingoz&aacute;st is, mert ezt k&eacute;zzel (na j&oacute;, XMPP-n kereszt&uuml;l) fogom triggerelni, &eacute;s csak akkor, ha a staging k&ouml;rnyezetbe rendben kiker&uuml;lt a k&oacute;d, illetve mindenki j&oacute;v&aacute;hagyta a m&uuml;k&ouml;d&eacute;st is. Egy&eacute;bk&eacute;nt az el&ouml;z&ouml; job m&aacute;solata volt.</p>

<p>&Iacute;gy gyakorlatilag az van, hogy amikor release van, akkor szok&aacute;s szerint mergelek egyet a master &aacute;gra, ezt felnyomom a git rep&oacute;ba, majd neki&aacute;llok t&uuml;relmetlen&uuml;l lesni az IM kliensem ablak&aacute;t. N&eacute;mi id&ouml; eltelt&eacute;vel a Jenkins besz&oacute;l, hogy (j&oacute; esetben) az aktu&aacute;lis job &aacute;tment minden l&eacute;p&eacute;sen, &eacute;s k&eacute;szen &aacute;ll az &eacute;les&iacute;t&eacute;sre. Ekkor megk&eacute;rem a jenkins-t, hogy deployoljon (jenkins, build project-deploy now), ez &aacute;tfuttatja m&eacute;g egyszer a teszteket, majd kiteszi az &eacute;les szerverre a k&oacute;dot, &uacute;jraind&iacute;tja a thin webszervert hozz&aacute;, &eacute;s k&eacute;sz is. Mivel mind a teszteknek mind a deploymentnek r&eacute;sze az adatb&aacute;zis friss&iacute;t&eacute;se is (rake db:migrate), &iacute;gy nem fordulhat el&ouml;, hogy a db s&eacute;ma miatt halunk meg.</p>

<p>Az&eacute;rt itt m&eacute;g nincs v&eacute;ge a t&ouml;rt&eacute;netnek, a k&ouml;vetkez&ouml; l&eacute;p&eacute;s az, hogy ellen&ouml;rizni kell, hogy az app fel is bootolt-e tisztess&eacute;gesen. Sajnos a thin webszervernek megvan az a kellemetlen tulajdons&aacute;ga, hogy csak azt v&aacute;rja meg, am&iacute;g &ouml; maga meg a k&ouml;rnyezete felbootol, miel&ouml;tt forkol, mag&aacute;t a rails appot nem v&aacute;rja be. Vagyis lehet, hogy &uacute;gy kapsz HTTP 500-at, hogy am&uacute;gy a thin azt jelezte vissza, hogy sikeresen elindult (a deployment utols&oacute; mozzanata az appszerver &uacute;jraind&iacute;t&aacute;sa). Egyel&ouml;re most a k&eacute;zi mel&oacute; is j&oacute;, a j&ouml;v&ouml;ben meg sztem lesz egy negat&iacute;v teszt, egy fix oldalra fogok egy curl-t h&iacute;vni, ha HTTP 200 j&ouml;n vissza, m&aacute;r j&oacute;k vagyunk.</p>
]]></content>
  </entry>
  
</feed>
