
<!DOCTYPE html>
<!--[if IEMobile 7 ]><html class="no-js iem7"><![endif]-->
<!--[if lt IE 9]><html class="no-js lte-ie8"><![endif]-->
<!--[if (gt IE 8)|(gt IEMobile 7)|!(IEMobile)|!(IE)]><!--><html class="no-js" lang="en"><!--<![endif]-->
<head>
  <meta charset="utf-8">
  <title>Hron's blog</title>
  <meta name="author" content="Gábor Garami" />

  
  <meta name="description" content="I just forgotten write down new rules for this blog. If it is possible and I am not too tired for it, I will write posts in English to practice this &hellip;" />
  

  <!-- http://t.co/dKP3o1e -->
  <meta name="HandheldFriendly" content="True" />
  <meta name="MobileOptimized" content="320" />
  <meta name="viewport" content="width=device-width, initial-scale=1" />

  
  <link rel="canonical" href="http://hron.me/blog/page/2/" />
  <link href="/favicon.ico" rel="icon" type="image/x-icon" />
  <link href="/stylesheets/blueprint/reset.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/stylesheets/blueprint/typography.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/stylesheets/application.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <link href="/stylesheets/code.css" media="screen, projection" rel="stylesheet" type="text/css" />
  <script src="/javascripts/modernizr-2.0.js"></script>
  <script src="/javascripts/ender.js"></script>
  <script src="/javascripts/octopress.js" type="text/javascript"></script>
  <link href="/atom.xml" rel="alternate" title="Hron's blog" type="application/atom+xml" />
  <!--Fonts from Google"s Web font directory at http://google.com/webfonts -->
<link href="http://fonts.googleapis.com/css?family=PT+Serif:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">
<link href="http://fonts.googleapis.com/css?family=PT+Sans:regular,italic,bold,bolditalic" rel="stylesheet" type="text/css">

  
  <script type="text/javascript">
    var _gaq = _gaq || [];
    _gaq.push(['_setAccount', "UA-20858841-1"]);
    _gaq.push(['_trackPageview']);

    (function() {
      var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
      ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
    })();
  </script>


</head>

<body   >
  <div id="header"><!-- <hgroup>
  <h1><a href="/">Hron's blog</a></h1>
  
    <h2>Who want to fly with doves loses the treasure down here</h2>
  
</hgroup> -->
<a class="logo"><img src="/images/bear-logo.png" alt="bear with earphone"></a>
<div class="userbox">



  
  <form action="http://google.com/search" method="get" class="search">
    <!-- <fieldset role="search"> -->
      <input type="hidden" name="q" value="site:hron.me" />
      <input class="search" type="text" name="q" results="0" placeholder="Search"/>
    <!-- </fieldset> -->
  </form>
  
  <div class="avatar"><a href="#" class="name">Hron's blog</a></div>
  <ul class="subscription usernav" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
  
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>

</ul>



</div>
</div>
  <!-- <nav role="navigation"><ul class="subscription usernav" data-subscription="rss">
  <li><a href="/atom.xml" rel="subscribe-rss" title="subscribe via RSS">RSS</a></li>
  
  
  <li><a href="/">Blog</a></li>
  <li><a href="/blog/archives">Archives</a></li>

</ul>


</nav> -->
  <div id="main" class="site dashboard">
    <div class="pagehead">
      <nav rel="navigation">
        <ul class="actions">
             <li><a href="/">Kezdőlap</a></li>
             <li><a href="/about/">Bemutatkozás</a></li>
         </ul>
      </nav>
      
    </div>

    <div id="content" class="columns container">
      <div class="blog-index first">
  
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2012/03/some-new-rules-uj-szabalyok/">Some new rules / Új szabályok</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>I just forgotten write down new rules for this blog. If it is possible and I am not too tired for it, I will write posts in English to practice this language. I found if I write continous text I can change my mind into English and I start thinking in English too. After this I can speak English easier too.</p>

<p>However, this rule will be dynamic. If I am too lazy, I will write Hungarian posts too, primarily because I wouldn&#8217;t like loose my Hungarian readers who do not know in English, such as my mom.</p>

<p>Stay tooned.</p>

<p>Elfelejtettem le&iacute;rni a blog &uacute;j szab&aacute;ly&aacute;t. Ha csak lehets&eacute;ges, &eacute;s nem vagyok t&uacute;l f&aacute;radt hozz&aacute;, a blogban angol nyelvű postok lesznek, a nyelv gyakorl&aacute;s&aacute;nak c&eacute;lj&aacute;b&oacute;l. Ez főleg az&eacute;rt van, mert azt tal&aacute;ltam, hogy ha hosszabb, egybef&uuml;ggő sz&ouml;veget kezdek el &iacute;rni, akkor az agyam automatikusan &aacute;tv&aacute;lt angolra, &eacute;s ut&aacute;na m&aacute;r sokkal k&ouml;nnyebben tudok pl. besz&eacute;lni is angolul.</p>

<p>Azonban, ez a szab&aacute;ly rugalmas lesz. Ha t&uacute;l lusta vagyok, akkor magyarul is fogok &iacute;rni, t&ouml;bbek k&ouml;zt az&eacute;rt, mert nem szeretn&eacute;m elvesz&iacute;teni csak magyarul tud&oacute; olvas&oacute;imat, pl. &eacute;desany&aacute;mat.</p>

<p>Stay tooned.</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2012/02/jenkins-rvm-bundler/">Jenkins, RVM, Bundler</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>Preface: Sorry for my poor english.</p>

<p>So, today I started thinking on how can I compile my rails app to different Ruby versions. Luckily, I discovered, Jenkins can use RVM to run rake tasks.</p>

<p>I initialized rvm following <a href="http://watirmelon.com/2011/08/29/running-your-watir-webdriver-tests-in-the-cloud-for-free/">this tutorial</a> but I just skipped EC2 instance creation, because I currently has a CI server. I installed three ruby version, MRI 1.8.7, MRI 1.9.3, and JRuby latest stable.</p>

<p>First, I created a Rakefile.bootstrap file in my project root to make bundle install phase to rake-ized because I wouldn&#8217;t like run this via shell state, as because I need to select the correct rvm what is can be changed and I wouldn&#8217;t like administer it on thee or more places.</p>

<p>Then, I was naive. I thinked I use separated gemset to avoid infecting global ruby scope with my project&#8217;s gems.</p>

<p>This is quite easy, I sudo-ed to jenkins, and created gemset by <code>rvm gemset create rhcp</code>. After viewing and saving Jenkins&#8217; main configuration are, rake plugin recognized this gemset, and offered to use it.</p>

<p>I clicked on it, saved the project, clicked on build, and pray (in the future: c&amp;p). No luck.</p>

<p>I spent a half of hour with investigation, and I found I need install rake to the target gemset too, not enough if it is installed with ruby or installed to the @global gemset. I installed rake, c&amp;p. No luck.</p>

<p>After it, I ran into <a href="http://stackoverflow.com/questions/3456304/rake-aborted-stack-level-too-deep">this problem</a>. Because rake loaded twice, it lost in the stack, and just gave up.</p>

<p>So, I added rake proxy for my bootstrap Rake file. It means calls the rake command prefixed by &#8216;bundle exec&#8217; since Jenkins cannot do this. Bundler cleans out unneccessary gems (eg.g what coming from @global, or from ruby itself) and executes rake command.</p>

<p>This is the final Rakefile.bootstrap if you want to use it:</p>

<p>&nbsp;</p>

<script src="https://gist.github.com/1838983.js?file=gistfile1.rb"></script>

</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2012/02/re-back-valami/">Re, back, valami</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>Fel&eacute;lesztem ezt a blogot, h&aacute;tha lesz is bel&ouml;le valami. Most visszaolvastam &eacute;s durv&aacute;n r&eacute;gen nem &iacute;rtam ide semmit, de megmondom &ouml;szint&eacute;n, nem vagyok az a blogol&oacute;s t&iacute;pus. M&eacute;gis, valahogy zavar ez az &uuml;res lap itten, h&aacute;t majd kital&aacute;lok valamit.</p>

<p>Most &eacute;ppen Rails fejlesztek nagyban. Szinte minden &uacute;j, ez kicsit frusztr&aacute;l is, de h&aacute;t haladni kell a korral. Rails 3, Devise, Resque, ActiveAdmin - csak hogy a f&ouml;bb dolgokat eml&iacute;tsem.</p>

<p>A legjobb a Rails fejleszt&eacute;sben, hogy ha otthon vagy a HTML-ben, CSS-ben, JS-ben, akkor k&ouml;nny&uuml; vele a munka, de ezekre mindenk&eacute;ppen sz&uuml;ks&eacute;g van, mert sok megold&aacute;s l&eacute;nyeg&eacute;t csak akkor lehet meg&eacute;rteni, ha az ember ismeri, hogy a fent eml&iacute;tett tri&oacute; hogyan m&uuml;k&ouml;dik, mi a c&eacute;lja, &eacute;s hogy lehet haszn&aacute;lni.</p>

<p>Van egy angol sr&aacute;c, IRC-n tal&aacute;lkoztunk, tan&iacute;tgatom &ouml;t Railsre. N&eacute;ha kicsit frusztr&aacute;l&oacute; dolog tud lenni, mert neh&eacute;z elvonatkoztatni att&oacute;l, hogy &eacute;n - m&eacute;g &uacute;gy is, hogy most tanulom &uacute;jra az eg&eacute;sz Rails-t - relat&iacute;ve <em>sokkal</em> t&ouml;bbet tudok, mint &ouml;. Szeg&eacute;nyk&eacute;m sajnos nagyon bizonytalanul mozog a JS ter&eacute;n - erre siker&uuml;lt neki egy igencsak JS intenz&iacute;v appba belekezdenie. Fil&oacute;zok rajta, hogy elkezdem &ouml;t arra szor&iacute;tani, hogy olvasgasson JS tutorialokat, mert nem lesz ez &iacute;gy j&oacute;&#8230; Amikor egy esem&eacute;nykezelőbe val&oacute; k&oacute;dot csak &uacute;gy bev&aacute;g valahova, az sose j&oacute; ir&aacute;ny.</p>

<p>Mondjuk nekem meg az angol nyelv okoz neh&eacute;zs&eacute;geket, nagyon sokszor szaladok bele abba, hogy nem tudok tov&aacute;bb menni. B&aacute;r nagyon sokszor alkalmazom azt a tr&uuml;kk&ouml;t, hogy ha nem tudod kimondani, &iacute;rd k&ouml;r&uuml;l, van, amikor m&eacute;g a k&ouml;r&uuml;l&iacute;r&aacute;shoz is hi&aacute;nyoznak a szavak. &Eacute;s olyankor sajnos csalnom kell, &eacute;s a Google Translate - ilyen szempontb&oacute;l - k&eacute;tes minős&eacute;gű seg&iacute;ts&eacute;g&eacute;re hagyatkozni.</p>

<p>Azt&aacute;n itt van m&eacute;g a fel&uacute;j&iacute;t&aacute;s projekt is. Borzaszt&oacute; dolog, p&aacute;r &eacute;vig biztos nem vetemedek ilyen egetverő őr&uuml;lts&eacute;gekre. Elősz&ouml;r is, sz&iacute;vszaggat&oacute; romokban l&aacute;tni a lak&aacute;st. M&aacute;sodszor, egy ilyen <strong>mindig</strong> elh&uacute;z&oacute;dik, f&uuml;ggetlen&uuml;l att&oacute;l, mennyire tervezted meg. Ez lassan negyed &eacute;ve k&iacute;nl&oacute;dik.. :s &eacute;s m&eacute;g nincs v&eacute;ge.</p>

<p>Na, becsukom a panaszl&aacute;d&aacute;t, megyek vissza k&oacute;dolni, csak ezt &iacute;gy egyben ki kellett m&aacute;r &iacute;rnom&#8230;</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2011/07/google-authenticator-for-ssh/">Google Authenticator for SSH</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>Na, ezt is kipr&oacute;b&aacute;ltam, yo.</p>

<p>A /etc/pam.d/system-remote-login f&aacute;jlban az auth include kezdet&uuml; sor ment &aacute;t erre:</p>

<p>auth&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; required&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pam_tally2.so onerr=succeed
auth&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; required&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pam_shells.so
auth&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; required&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pam_nologin.so
auth&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; required&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pam_env.so
auth&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; sufficient&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; pam_google_authenticator.so</p>

<p>K&eacute;ri az authentikator k&oacute;djat, enter, es bel&eacute;p. A Pubkey auth fel&uuml;lv&aacute;gja, ofc.</p>

<p>Szerk: ja, &eacute;s kell neki a ChallengeResponseAuthentication yes</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2011/07/dr-otker/">Dr Ötker</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>Tegnap tettem egy r&ouml;vid l&aacute;togat&aacute;st kedvenc Interspar-omban, &eacute;s vettem egy csom&oacute; acci&oacute;s gy&uuml;m&ouml;lcslevesport, t&eacute;len-ny&aacute;ron kiv&aacute;l&oacute; turmix van bel&ouml;l&uuml;k. Hogy-hogy nem, beker&uuml;lt a sorba egy s&aacute;rgabarackos tejberizs is - val&oacute;sz&iacute;n&uuml;leg mell&eacute;ny&uacute;ltam. Mindenesetre &aacute;rban nem volt nagy difi, belef&eacute;rt.</p>

<p>Hogy ne vesszen pocs&eacute;kba, csak k&aacute;rba, gyorsan &ouml;sszedobtam r&aacute; valamit.</p>

<p>&nbsp;- 1/2 doboz 0.5l-es SPAR vanili&aacute;s ital (egy kicsit sokat vettem bel&ouml;le a j&oacute;m&uacute;ltkor&#8230;)
&nbsp;- 1 poh&aacute;r tej (ez eddig ugye f&eacute;l liter, ennyi folyad&eacute;k &aacute;ll a zacsin)
&nbsp;- 1 zacsi tejberizs kezdem&eacute;ny (ez ugye most a s&aacute;rgabarackos)</p>

<p>Tot&aacute;l a zacsi szerint j&aacute;rtam el, alapos felforral&aacute;s (megv&aacute;rtam, mig takar&eacute;kon elkezd kin&eacute;zni a faz&eacute;kb&oacute;l - ez csak el&eacute;g alapos&#8230;), 1 perces (alapos) kever&eacute;s,
10 perc (alapos :-) ) fed&ouml;. Na itt &aacute;llunk most.</p>

<p>Uhh, el is felejtettem friss&iacute;teni. Na, sz&oacute;val feledhetetlen volt, b&aacute;r legk&ouml;zelebb picit kevesebb vanili&aacute;s tejet &eacute;s egy picit t&ouml;bb sima tejet rakok bele.</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2011/07/1-centes-bolt/">1 Centes bolt</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>R&eacute;gebb &oacute;ta itt van a sarokban, de most megint belepiszk&aacute;ltam, egy CentOS repo. Ilyesmik vannak benne, mint</p>

<ul>
<li>Viszonylag &uacute;j apache</li>
<li>Ruby 1.8.7 (egy vicc, hogy a CentOS 5.6 is nagyon r&eacute;gi rubyt hoz)</li>
<li>Egy rak&aacute;s gem</li>
<li>Sun JDK/JRE 1.6</li>
</ul>


<p>Repo <a href="http://users.hanzo.hu/~hron/centos/">itt</a>, Yum konfig <a href="http://users.hanzo.hu/~hron/centos/hron.repo">erre</a>. A kulcs nem t&ouml;lt&ouml;dik le automat&aacute;n, tess&eacute;k leszedni &eacute;s a megfelel&ouml; helyre rakni.
Akinek megvan a levelez&ouml;s GPG kulcsom, az csak export&aacute;lja r&aacute; az rpm-re:</p>

<figure class='code'><div class="highlight"><table><tr><td class="gutter"><pre class="line-numbers"><span class='line-number'>1</span>
<span class='line-number'>2</span>
</pre></td><td class='code'><pre><code class=''><span class='line'>gpg -a --export 51d11d3b &gt; x.asc
</span><span class='line'>rpm --import x.asc</span></code></pre></td></tr></table></div></figure>

</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2011/06/viharos-ej/">Viharos éj</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>H&aacute;t, el&eacute;g cs&uacute;nya vihar volt itt d&eacute;lut&aacute;n. Mondjuk legal&aacute;bb v&eacute;gre eld&ouml;nt&ouml;tte mag&aacute;t az id&ouml;, mert m&aacute;r borzaszt&oacute; unalmas volt ez a se ide, se oda totoj&aacute;z&aacute;s.<p />Ellenben volt egy hatalmas villan&aacute;s, &eacute;s akkor&aacute;t d&ouml;rg&ouml;tt, hogy l&aacute;that&oacute;an megremegtek az ablakt&aacute;bl&aacute;k, &eacute;s az &ouml;sszes aut&oacute; riaszt&oacute;ja bekapcsolt.
&Eacute;n meg csak reszkettem, mint egy f&eacute;l&eacute;nk kaktusz&#8230; Szerencs&eacute;re semmilyen komolyabb baj nem t&ouml;rt&eacute;nt.<p />(titkos <a href="http://www.google.hu/search?q=%22f%C3%A9l%C3%A9nk+kaktusz%22" target="_blank">keres&ouml;teszt&#8230;</a>)</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2011/02/mult-es-jovo/">Mult es jovo</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><p>Valaki ezt irta be facebook-ra:</p>

<blockquote class="posterous_medium_quote">
Maradj a jelenben. Semmit sem tehetsz, hogy megv&aacute;ltoztasd a m&uacute;ltat, a  j&ouml;vő pedig soha nem lesz pontosan olyan, amilyennek tervezed vagy  rem&eacute;led. F&aacute;jdalmad, f&eacute;lelmed &eacute;s d&uuml;h&ouml;d, sajn&aacute;lkoz&aacute;sod &eacute;s bűntudatod,  terveid &eacute;s s&oacute;v&aacute;rg&aacute;said csak a m&uacute;ltban vagy a j&ouml;vőben &eacute;lnek.


</blockquote>


<p>De mit tehet az ember, ha ugy erzi: szeretne visszamenni a multba, es megvaltoztatni dolgokat, amiket elrontott? Mi van akkor, ha ugy erzed: visszavonhatatlanul elrontottal valamit, es nagyon ki kene javitani?</p>

<p>Nem tudom. Nekem szerencsere nagyon keves ilyen pont van, amit ki kene javitani, de sajnos van. Vannak dolgok, amiket nem ugy kellett volna megoldani, ahogy megoldottam. Azt hittem celravezeto, de nem volt az. Sokkal rosszabb volt, mintha csak hagytam volna, hogy a dolgok megtortenjenek. A fajdalom mindig ugyanakkora, ha valakit elveszitunk, ezen nem lehet kisebbiteni. El lehet takarni, el lehet nyomni, de a fajdalom a felszinre tor.</p>

<p>Nagyon rossz a fajdalom, de meg rosszabb az onvad. Buvopatakkent bujik meg a lelkedben, es a legrosszabbkor tor a felszinre. Amikor nem is szamitasz ra. Persze, nincs sok eredmenye, ha az ember ostorozza magat multbeli hibaiert, am bizonyos hibakra (foleg, amelyek visszavonhatatlanok) nincs megoldas, nincs feloldozas. Meg ha senki sem hibaztat mar, meg ha mindenki el is felejtette, te magad meg mindig emlekszel a hibaidra.</p>

<p>Es erre csak egy megoldas lehet: a felejtes. Feledni a hibakat, es tanulni beloluk: roppant nehez. De csak egyfelekepp lehet tuljutni a melypontokon: ha a jovot helyezed eloterbe. Nem lehet a multban elni. Csak&#8230; nehez a megbocsatas onmagadnak&#8230; masnak sokkal egyszerubb elnezni a hibait, mint a magadet. Ehhez szeretned kell onmagadat, azt, aki jelenleg vagy. Akkor is, ha az nem epp egy szeretheto figura. Foleg akkor.</p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2011/01/koponyeghu-elso-android-appom/">Koponyeg.hu - Elso android appom</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><div class='p_embed p_image_embed'>
<img alt="Emulator-5556" height="480" src="http://getfile5.posterous.com/getfile/files.posterous.com/hron84/PByraI5lM3QChvcI9cCMTpW4ldkt4y6YA2LersWz52H5cfATxqpgEt7eJJjn/emulator-5556.png" width="320" />
</div>


<p>Eletem elso Androidos alkalmazasa, a koponyeg.hu -hoz biztosit klienst.</p>

<p>Letoltes:
<a><img src="http://qr-kod.hu/qr-kod.php?type=url&amp;size=L&amp;t=http%253A%252F%252Fusers.hanzo.hu%252F~hron%252FKoponyeg.apk" alt="qr-kod" /></a></p>
</div>
  
  


    </article>
  
  
    <article>
      
  <header>
    
      <h1 class="entry-title"><a href="/blog/2010/12/jomunkasmedve-2-az-orzo/">Jómunkásmedve 2</a></h1>
    
    
      <p class="meta">
        
      </p>
    
  </header>


  <div class="entry-content"><div class='p_embed p_image_embed'>
<a href="http://getfile1.posterous.com/getfile/files.posterous.com/hron84/MOshuYUqYoNxgTrDfRXi9hoqT1HI0fN0RxnwYjcCq6c2xge6MnOW3pCIoLGq/2010-12-17_15.56.32.jpg.scaled.1000.jpg"><img alt="2010-12-17_15" height="667" src="http://getfile0.posterous.com/getfile/files.posterous.com/hron84/gAMZ483SiDACbO4XXOoEnHvcv9IC72XclYxhCQk3FHphbCZNtPZbmQBOULnB/2010-12-17_15.56.32.jpg.scaled.500.jpg" width="500" /></a>
</div>


<p>K&ouml;zk&iacute;v&aacute;natra</p>
</div>
  
  


    </article>
  
  <div class="pagination">
    
      <a class="prev" href="/blog/page/3/">&larr; Older</a>
    
    <a href="/blog/archives">Blog Archives</a>
    
    <a class="next" href="/">Newer &rarr;</a>
    
  </div>
</div>
<aside class="sidebar last">
  
    <section>
  <h1>Recent Posts</h1>
  <ul id="recent_posts">
    
      <li class="post">
        <a href="/blog/2012/11/rubymine-es-teamcity/">RubyMine és TeamCity</a>
      </li>
    
      <li class="post">
        <a href="/blog/2012/10/logging-with-logstash/">Logging with Logstash</a>
      </li>
    
      <li class="post">
        <a href="/blog/2012/10/guard-projektjeink-testore/">Guard - projektjeink testőre</a>
      </li>
    
      <li class="post">
        <a href="/blog/2012/10/github-powa/">GitHub powa</a>
      </li>
    
      <li class="post">
        <a href="/blog/2012/09/valamit-maskeppen/">Valamit másképpen</a>
      </li>
    
  </ul>
</section>
<section>
  <h1>Categories</h1>
    <ul id="category-list"><li><a href='/blog/tags/android'>android (1)</a></li><li><a href='/blog/tags/bear'>bear (3)</a></li><li><a href='/blog/tags/blog'>blog (1)</a></li><li><a href='/blog/tags/brno'>brno (2)</a></li><li><a href='/blog/tags/centos'>centos (1)</a></li><li><a href='/blog/tags/continous-deployment'>continous deployment (1)</a></li><li><a href='/blog/tags/cooking'>cooking (1)</a></li><li><a href='/blog/tags/en'>en (5)</a></li><li><a href='/blog/tags/git'>git (1)</a></li><li><a href='/blog/tags/google-authenticator'>google authenticator (1)</a></li><li><a href='/blog/tags/hu'>hu (17)</a></li><li><a href='/blog/tags/humour'>humour (1)</a></li><li><a href='/blog/tags/jenkins'>jenkins (2)</a></li><li><a href='/blog/tags/pic'>pic (3)</a></li><li><a href='/blog/tags/posterous'>posterous (1)</a></li><li><a href='/blog/tags/qt'>qt (1)</a></li><li><a href='/blog/tags/rails'>rails (3)</a></li><li><a href='/blog/tags/recipe'>recipe (1)</a></li><li><a href='/blog/tags/repository'>repository (1)</a></li><li><a href='/blog/tags/ruby'>ruby (3)</a></li><li><a href='/blog/tags/rvm'>rvm (1)</a></li><li><a href='/blog/tags/ssh'>ssh (1)</a></li><li><a href='/blog/tags/sysadmin'>sysadmin (1)</a></li><li><a href='/blog/tags/tech'>tech (2)</a></li><li><a href='/blog/tags/testing'>testing (1)</a></li><li><a href='/blog/tags/thinking'>thinking (2)</a></li><li><a href='/blog/tags/travel'>travel (2)</a></li><li><a href='/blog/tags/tutorial'>tutorial (5)</a></li><li><a href='/blog/tags/wordpress'>wordpress (1)</a></li></ul>
</section>

<section>
  <h1>GitHub Repos</h1>
  <ul id="gh_repos">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  
  <a href="https://github.com/hron84">@hron84</a> on GitHub
  
  <script type="text/javascript">
    $.domReady(function(){
        if (!window.jXHR){
            var jxhr = document.createElement('script');
            jxhr.type = 'text/javascript';
            jxhr.src = '/javascripts/libs/jXHR.js';
            var s = document.getElementsByTagName('script')[0];
            s.parentNode.insertBefore(jxhr, s);
        }

        github.showRepos({
            user: 'hron84',
            count: 4,
            skip_forks: true,
            target: '#gh_repos'
        });
    });
  </script>
  <script src="/javascripts/github.js" type="text/javascript"> </script>
</section>


<section>
  <h1>Latest Tweets</h1>
  <ul id="tweets">
    <li class="loading">Status updating&#8230;</li>
  </ul>
  <script type="text/javascript">
    $.domReady(function(){
      getTwitterFeed("hron84", 4, false);
    });
  </script>
  <script src="/javascripts/twitter.js" type="text/javascript"> </script>
  
    <a href="http://twitter.com/hron84" class="twitter-follow-button" data-show-count="false">Follow @hron84</a>
  
</section>


<section>
  <h1>On Delicious</h1>
  <div id="delicious"></div>
  <script type="text/javascript" src="http://feeds.delicious.com/v2/json/hron84?count=3&amp;sort=date&amp;callback=renderDeliciousLinks"></script>
  <p><a href="http://delicious.com/hron84">My Delicious Bookmarks &raquo;</a></p>
</section>



  
</aside>
<div class="rule">&nbsp;</div>

    </div>
  </div>
  <footer role="contentinfo"><div id="footer" class="clearfix">
  <div class="site">
    <div class="copy">
      
      Copyright &copy; 2012 - Gábor Garami &mdash; Some rights reserved<br/>
      <small class="license">
        Contents and design are licensed under the terms of <br/>
        <a href="http://creativecommons.org/licenses/by-sa/3.0/">
          <img src="/images/cc.png" alt="creativecommons" />
          &nbsp;CreativeCommons BY-SA 3.0 Unported License</a>
      </small>
    </div>
    <div class="powa">
      <span class="credit">Powered by <a href="http://octopress.org">Octopress</a></span><br/>
      <span class="credit">Hosted by <a href="https://github.com/">GitHub Pages</a></span>
    </div>
  </div>
</div>

</footer>
  

<script type="text/javascript">
      var disqus_shortname = 'hron84';
      
        
        var disqus_script = 'count.js';
      
    (function () {
      var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
      dsq.src = 'http://' + disqus_shortname + '.disqus.com/' + disqus_script;
      (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
    }());
</script>



<div id="fb-root"></div>
<script>(function(d, s, id) {
  var js, fjs = d.getElementsByTagName(s)[0];
  if (d.getElementById(id)) {return;}
  js = d.createElement(s); js.id = id;
  js.src = "//connect.facebook.net/en_US/all.js#appId=212934732101925&xfbml=1";
  fjs.parentNode.insertBefore(js, fjs);
}(document, 'script', 'facebook-jssdk'));</script>



  <script type="text/javascript">
    (function() {
      var script = document.createElement('script'); script.type = 'text/javascript'; script.async = true;
      script.src = 'https://apis.google.com/js/plusone.js';
      var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(script, s);
    })();
  </script>



  <script type="text/javascript">
    (function(){
      var twitterWidgets = document.createElement('script');
      twitterWidgets.type = 'text/javascript';
      twitterWidgets.async = true;
      twitterWidgets.src = 'http://platform.twitter.com/widgets.js';
      document.getElementsByTagName('head')[0].appendChild(twitterWidgets);
    })();
  </script>





</body>
</html>
