<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">

  <title><![CDATA[Category: thinking | Hron's blog]]></title>
  <link href="http://hron.me/blog/tags/thinking/atom.xml" rel="self"/>
  <link href="http://hron.me/"/>
  <updated>2013-03-17T14:00:59+01:00</updated>
  <id>http://hron.me/</id>
  <author>
    <name><![CDATA[Gábor Garami]]></name>
    
  </author>
  <generator uri="http://octopress.org/">Octopress</generator>

  
  <entry>
    <title type="html"><![CDATA[Valamit másképpen]]></title>
    <link href="http://hron.me/blog/2012/09/valamit-maskeppen/"/>
    <updated>2012-09-09T01:14:58+02:00</updated>
    <id>http://hron.me/blog/2012/09/valamit-maskeppen</id>
    <content type="html"><![CDATA[<p>A HUP-on bedobott <a href="http://hup.hu/szavazasok/20120908/mit_tennel_az_utolso_napodon">szavaz&aacute;s</a>&nbsp;gondolkodtatott el azon, hogy csin&aacute;ln&eacute;k-e valamit alapvet&ouml;en m&aacute;sk&eacute;ppen, ha &uacute;jrakezdhetn&eacute;m az &eacute;letemet. Nagyon cs&aacute;b&iacute;t&oacute; a lehet&ouml;s&eacute;g, mert hib&aacute;ztam, nem is egyszer, sokszor, n&eacute;ha kicsit, n&eacute;ha nagyot.</p>

<p>Akkor &eacute;s ott &uacute;gy &eacute;reztem, hogy nagyon gyorsan meg kellene nyomni a backspace gombot, &eacute;s nekifutni megint. De ut&oacute;lag visszan&eacute;zve mindig r&aacute;j&ouml;v&ouml;k, hogy h&uuml;lyes&eacute;g lett volna. Mert akkor egy csom&oacute; j&oacute; dolog sem t&ouml;rt&eacute;nt volna meg velem az &eacute;letben.</p>

<p>Tal&aacute;n egyetlen esem&eacute;ny van, amit megakad&aacute;lyozn&eacute;k, b&aacute;r jelenleg nem tudom felm&eacute;rni, mekkora hat&aacute;sa lenne: a tavalyel&ouml;tt ny&aacute;ri esem&eacute;nyeket. Az az egy h&oacute;napnyi k&iacute;nl&oacute;d&aacute;s lehet, hogy megsp&oacute;rolhat&oacute; lett volna. Nem biztos, de lehet.</p>

<p>De a t&ouml;bbin nem v&aacute;ltoztatn&eacute;k. S&ouml;t, m&eacute;g csak azt sem szeretn&eacute;m, hogy eg&eacute;szs&eacute;gesen sz&uuml;lessek. Nem volt egyszer&uuml; a betegs&eacute;gemmel, ez t&eacute;ny. &Eacute;s azt is tudom, hogy a k&ouml;rnyezetemnek sem volt egyszer&uuml;. De ha nem annak sz&uuml;letek, akinek, ma nem lehetek az, aki, &eacute;s nem lehetnek azok a bar&aacute;taim, akik. A k&eacute;t legjobb bar&aacute;tomat &uacute;gy ismertem meg, hogy interneten k&eacute;rtek t&ouml;lem seg&iacute;ts&eacute;get. Eg&eacute;szs&eacute;gesk&eacute;nt tal&aacute;n nem &uuml;ln&eacute;k ennyit a g&eacute;p el&ouml;tt, hiszen nagyon impulz&iacute;v &eacute;s akt&iacute;v emberke vagyok egy&eacute;bk&eacute;nt, de ez azzal j&aacute;r, hogy lemaradn&eacute;k mindenr&ouml;l, ami most fontos.
Emiatt gondolom azt, hogy - b&aacute;r kellemetlen, de - nem baj az, ami van velem. &Eacute;n egy picit m&aacute;s vagyok, n&aacute;lam ez az "eg&eacute;szs&eacute;ges".</p>

<p>V&aacute;lasztan&eacute;k-e m&aacute;sik csal&aacute;dot, k&ouml;rnyezetet? Aki k&ouml;zelebbr&ouml;l ismer, tudja, hogy n&aacute;lam m&eacute;g ez sem egy egyszer&uuml; eld&ouml;ntend&ouml; k&eacute;rd&eacute;s. De &uacute;gy gondolom, nem. Nem volt sima &eacute;letem, voltak g&ouml;r&ouml;ngy&ouml;k, bukkan&oacute;k, hegyek &eacute;s v&ouml;lgyek. Volt, amikor nagy volt a s&ouml;t&eacute;t, volt amikor sok volt a f&eacute;ny. De hiszem, hogy ezek is seg&iacute;tettek olyann&aacute; form&aacute;lni, amilyen most vagyok.&nbsp;</p>

<p>Csak n&eacute;h&aacute;ny dolog van, amiken v&aacute;ltoztatn&eacute;k. P&aacute;r &eacute;letvitelbeli apr&oacute;s&aacute;g. P&aacute;r apr&oacute; t&aacute;rgy, amire jobban vigy&aacute;zn&eacute;k. &Eacute;s n&eacute;h&aacute;ny ember, akikkel egy kicsit t&ouml;bb id&ouml;t t&ouml;lten&eacute;k, kicsit jobban szeretn&eacute;m &ouml;ket, mert &uacute;gy &eacute;rzem, ad&oacute;s maradtam. De ez minden.</p>
]]></content>
  </entry>
  
  <entry>
    <title type="html"><![CDATA[Mult es jovo]]></title>
    <link href="http://hron.me/blog/2011/02/mult-es-jovo/"/>
    <updated>2011-02-06T11:14:26+01:00</updated>
    <id>http://hron.me/blog/2011/02/mult-es-jovo</id>
    <content type="html"><![CDATA[<p>Valaki ezt irta be facebook-ra:</p>

<blockquote class="posterous_medium_quote">
Maradj a jelenben. Semmit sem tehetsz, hogy megv&aacute;ltoztasd a m&uacute;ltat, a  j&ouml;vő pedig soha nem lesz pontosan olyan, amilyennek tervezed vagy  rem&eacute;led. F&aacute;jdalmad, f&eacute;lelmed &eacute;s d&uuml;h&ouml;d, sajn&aacute;lkoz&aacute;sod &eacute;s bűntudatod,  terveid &eacute;s s&oacute;v&aacute;rg&aacute;said csak a m&uacute;ltban vagy a j&ouml;vőben &eacute;lnek.


</blockquote>


<p>De mit tehet az ember, ha ugy erzi: szeretne visszamenni a multba, es megvaltoztatni dolgokat, amiket elrontott? Mi van akkor, ha ugy erzed: visszavonhatatlanul elrontottal valamit, es nagyon ki kene javitani?</p>

<p>Nem tudom. Nekem szerencsere nagyon keves ilyen pont van, amit ki kene javitani, de sajnos van. Vannak dolgok, amiket nem ugy kellett volna megoldani, ahogy megoldottam. Azt hittem celravezeto, de nem volt az. Sokkal rosszabb volt, mintha csak hagytam volna, hogy a dolgok megtortenjenek. A fajdalom mindig ugyanakkora, ha valakit elveszitunk, ezen nem lehet kisebbiteni. El lehet takarni, el lehet nyomni, de a fajdalom a felszinre tor.</p>

<p>Nagyon rossz a fajdalom, de meg rosszabb az onvad. Buvopatakkent bujik meg a lelkedben, es a legrosszabbkor tor a felszinre. Amikor nem is szamitasz ra. Persze, nincs sok eredmenye, ha az ember ostorozza magat multbeli hibaiert, am bizonyos hibakra (foleg, amelyek visszavonhatatlanok) nincs megoldas, nincs feloldozas. Meg ha senki sem hibaztat mar, meg ha mindenki el is felejtette, te magad meg mindig emlekszel a hibaidra.</p>

<p>Es erre csak egy megoldas lehet: a felejtes. Feledni a hibakat, es tanulni beloluk: roppant nehez. De csak egyfelekepp lehet tuljutni a melypontokon: ha a jovot helyezed eloterbe. Nem lehet a multban elni. Csak... nehez a megbocsatas onmagadnak... masnak sokkal egyszerubb elnezni a hibait, mint a magadet. Ehhez szeretned kell onmagadat, azt, aki jelenleg vagy. Akkor is, ha az nem epp egy szeretheto figura. Foleg akkor.</p>
]]></content>
  </entry>
  
</feed>
